{
	"add_bos_token": false,
	"add_eos_token": false,
	"bos_token": {
		"__type": "AddedToken",
		"content": "<s>",
		"lstrip": false,
		"normalized": false,
		"rstrip": false,
		"single_word": false
	},
	"eos_token": {
		"__type": "AddedToken",
		"content": "</s>",
		"lstrip": false,
		"normalized": false,
		"rstrip": false,
		"single_word": false
	},
	"unk_token": {
		"__type": "AddedToken",
		"content": "<unk>",
		"lstrip": false,
		"normalized": false,
		"rstrip": false,
		"single_word": false
	},
	"pad_token": {
		"__type": "AddedToken",
		"content": "<unk>",
		"lstrip": false,
		"normalized": false,
		"rstrip": false,
		"single_word": true
	},
	"added_tokens_decoder": {
		"3": {
			"content": "reserved_0",
			"lstrip": false,
			"normalized": false,
			"rstrip": false,
			"single_word": false,
			"special": true
		},
		"4": {
			"content": "reserved_1",
			"lstrip": false,
			"normalized": false,
			"rstrip": false,
			"single_word": false,
			"special": true
		}
	},
	"clean_up_tokenization_spaces": false,
	"spaces_between_special_tokens": false,
	"add_prefix_space": false,
	"legacy": false,
	"model_max_length": 1e5,
	"sp_model_kwargs": {},
	"tokenizer_class": "IndexTokenizer",
	"auto_map": {
		"AutoTokenizer": [
			"tokenization_index.IndexTokenizer",
			null
		]
	},
	"use_default_system_prompt": false,
  	"chat_template": "{%- if tools %}\n    {{- '<s>system\\n' }}\n    {%- if messages[0].role == 'system' %}\n        {{- messages[0].content + '\\n\\n' }}\n    {%- endif %}\n    {{- \"# Tools\\n\\nYou may call one or more functions to assist with the user query.\\n\\nYou are provided with function signatures within <tools></tools> XML tags:\\n<tools>\" }}\n    {%- for tool in tools %}\n        {{- \"\\n\" }}\n        {{- tool | tojson }}\n    {%- endfor %}\n    {{- \"\\n</tools>\\n\\nFor each function call, return a json object with function name and arguments within <tool_call></tool_call> XML tags:\\n<tool_call>\\n{\\\"name\\\": <function-name>, \\\"arguments\\\": <args-json-object>}\\n</tool_call></s>\\n\" }}\n{%- else %}\n {%- if messages[0]['role'] == 'system' -%}\n        {{- '<s>system\\n' + messages[0]['content'] + '</s>\\n' }}\n    {%- else -%}\n        {{- '<s>system\\nYou are a helpful assistant</s>\\n' }}\n {%- endif %}\n{%- endif %}\n{%- set ns = namespace(multi_step_tool=true, last_query_index=messages|length - 1) %}\n{%- for message in messages[::-1] %}\n    {%- set index = (messages|length - 1) - loop.index0 %}\n    {%- if ns.multi_step_tool and message.role == \"user\" and message.content is string and not(message.content.startswith('<tool_response>') and message.content.endswith('</tool_response>')) %}\n        {%- set ns.multi_step_tool = false %}\n        {%- set ns.last_query_index = index %}\n    {%- endif %}\n{%- endfor %}\n{%- for message in messages %}\n    {%- if message.content is string %}\n        {%- set content = message.content %}\n    {%- else %}\n        {%- set content = '' %}\n    {%- endif %}\n    {%- if (message.role == \"user\") or (message.role == \"system\" and not loop.first) %}\n        {{- '<s>' + message.role + '\\n' + content + '</s>' + '\\n' }}\n    {%- elif message.role == \"assistant\" %}\n   {{- '<s>' + message.role + '\\n' + content }}\n  {%- if message.tool_calls %}\n            {%- for tool_call in message.tool_calls %}\n                {%- if (loop.first and content) or (not loop.first) %}\n                    {{- '\\n' }}\n                {%- endif %}\n                {%- if tool_call.function %}\n                    {%- set tool_call = tool_call.function %}\n                {%- endif %}\n                {{- '<tool_call>\\n{\"name\": \"' }}\n                {{- tool_call.name }}\n                {{- '\", \"arguments\": ' }}\n                {%- if tool_call.arguments is string %}\n                    {{- tool_call.arguments }}\n                {%- else %}\n                    {{- tool_call.arguments | tojson }}\n                {%- endif %}\n                {{- '}\\n</tool_call>' }}\n            {%- endfor %}\n        {%- endif %}\n        {{- '</s>\\n' }}\n    {%- elif message.role == \"tool\" %}\n        {%- if loop.first or (messages[loop.index0 - 1].role != \"tool\") %}\n            {{- '<s>user' }}\n        {%- endif %}\n        {{- '\\n<tool_response>\\n' }}\n        {{- content }}\n        {{- '\\n</tool_response>' }}\n        {%- if loop.last or (messages[loop.index0 + 1].role != \"tool\") %}\n            {{- '</s>\\n' }}\n        {%- endif %}\n    {%- endif %}\n{%- endfor %}\n{%- if add_generation_prompt %}\n    {{- '<s>assistant\\n' }}\n    {%- if enable_thinking is defined and enable_thinking is false %}\n        {{- '<think>\\n\\n</think>\\n\\n' }}\n    {%- endif %}\n{%- endif %}"
}


